memtier/performance/data/armorix/all-1.out
12        Threads
50        Connections per thread
50        Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets        11651.28          ---          ---         4.86630         4.79900         7.07100         8.38300        12.03100       794.93 
Gets       116457.41         0.00    116457.41         4.66397         4.63900         5.85500         6.65500         8.38300      2944.30 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals     128108.69         0.00    116457.41         4.68237         4.67100         5.98300         6.81500         9.08700      3739.24 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.175        0.000
SET       4.447        5.000
SET       4.511       10.000
SET       4.575       15.000
SET       4.607       20.000
SET       4.639       25.000
SET       4.703       30.000
SET       4.703       35.000
SET       4.735       40.000
SET       4.767       45.000
SET       4.799       50.000
SET       4.831       52.500
SET       4.831       55.000
SET       4.863       57.500
SET       4.863       60.000
SET       4.895       62.500
SET       4.895       65.000
SET       4.927       67.500
SET       4.959       70.000
SET       4.959       72.500
SET       4.991       75.000
SET       4.991       76.250
SET       5.023       77.500
SET       5.023       78.750
SET       5.055       80.000
SET       5.055       81.250
SET       5.087       82.500
SET       5.087       83.750
SET       5.119       85.000
SET       5.151       86.250
SET       5.151       87.500
SET       5.183       88.125
SET       5.183       88.750
SET       5.215       89.375
SET       5.215       90.000
SET       5.247       90.625
SET       5.247       91.250
SET       5.279       91.875
SET       5.311       92.500
SET       5.343       93.125
SET       5.375       93.750
SET       5.375       94.062
SET       5.407       94.375
SET       5.439       94.688
SET       5.439       95.000
SET       5.471       95.312
SET       5.503       95.625
SET       5.535       95.938
SET       5.599       96.250
SET       5.631       96.562
SET       5.695       96.875
SET       5.727       97.031
SET       5.791       97.188
SET       5.823       97.344
SET       5.855       97.500
SET       5.919       97.656
SET       5.983       97.812
SET       6.047       97.969
SET       6.143       98.125
SET       6.239       98.281
SET       6.335       98.438
SET       6.431       98.516
SET       6.495       98.594
SET       6.591       98.672
SET       6.687       98.750
SET       6.815       98.828
SET       6.911       98.906
SET       7.039       98.984
SET       7.167       99.062
SET       7.327       99.141
SET       7.455       99.219
SET       7.551       99.258
SET       7.647       99.297
SET       7.743       99.336
SET       7.871       99.375
SET       7.999       99.414
SET       8.127       99.453
SET       8.319       99.492
SET       8.511       99.531
SET       8.767       99.570
SET       9.023       99.609
SET       9.151       99.629
SET       9.343       99.648
SET       9.471       99.668
SET       9.663       99.688
SET       9.791       99.707
SET       9.983       99.727
SET      10.175       99.746
SET      10.367       99.766
SET      10.559       99.785
SET      10.751       99.805
SET      10.815       99.814
SET      10.943       99.824
SET      11.071       99.834
SET      11.199       99.844
SET      11.327       99.854
SET      11.455       99.863
SET      11.583       99.873
SET      11.711       99.883
SET      11.903       99.893
SET      12.031       99.902
SET      12.159       99.907
SET      12.223       99.912
SET      12.351       99.917
SET      12.415       99.922
SET      12.543       99.927
SET      12.735       99.932
SET      12.863       99.937
SET      12.991       99.941
SET      13.183       99.946
SET      13.439       99.951
SET      13.503       99.954
SET      13.631       99.956
SET      13.695       99.958
SET      13.823       99.961
SET      13.951       99.963
SET      14.143       99.966
SET      14.271       99.968
SET      14.463       99.971
SET      14.655       99.973
SET      14.975       99.976
SET      15.103       99.977
SET      15.295       99.978
SET      15.487       99.979
SET      15.615       99.980
SET      15.871       99.982
SET      16.063       99.983
SET      16.255       99.984
SET      16.383       99.985
SET      16.639       99.987
SET      16.767       99.988
SET      16.895       99.988
SET      17.023       99.989
SET      17.151       99.990
SET      17.279       99.990
SET      17.407       99.991
SET      17.407       99.991
SET      17.535       99.992
SET      17.791       99.993
SET      17.791       99.993
SET      17.919       99.994
SET      18.047       99.994
SET      18.047       99.995
SET      18.175       99.995
SET      18.303       99.995
SET      18.303       99.995
SET      18.431       99.996
SET      18.431       99.996
SET      18.559       99.996
SET      18.687       99.997
SET      18.687       99.997
SET      18.815       99.997
SET      18.815       99.997
SET      18.815       99.997
SET      18.943       99.998
SET      18.943       99.998
SET      19.071       99.998
SET      19.071       99.998
SET      19.071       99.998
[...]
SET      19.199       99.998
SET      19.199       99.999
SET      19.199       99.999
SET      19.199       99.999
[...]
SET      19.327       99.999
SET      19.327       99.999
SET      19.455       99.999
SET      19.455       99.999
SET      19.455       99.999
[...]
SET      19.967      100.000
SET      19.967      100.000
SET      19.967      100.000
[...]
SET      20.223      100.000
SET      20.223      100.000
SET      20.223      100.000
[...]
SET      20.351      100.000
SET      20.351      100.000
---
GET       0.079        0.000
GET       4.255        5.000
GET       4.351       10.000
GET       4.415       15.000
GET       4.447       20.000
GET       4.479       25.000
GET       4.511       30.000
GET       4.543       35.000
GET       4.607       40.000
GET       4.607       45.000
GET       4.639       50.000
GET       4.671       52.500
GET       4.703       55.000
GET       4.703       57.500
GET       4.703       60.000
GET       4.735       62.500
GET       4.735       65.000
GET       4.767       67.500
GET       4.799       70.000
GET       4.799       72.500
GET       4.831       75.000
GET       4.831       76.250
GET       4.863       77.500
GET       4.863       78.750
GET       4.895       80.000
GET       4.895       81.250
GET       4.895       82.500
GET       4.927       83.750
GET       4.927       85.000
GET       4.959       86.250
GET       4.959       87.500
GET       4.991       88.125
GET       4.991       88.750
GET       4.991       89.375
GET       5.023       90.000
GET       5.023       90.625
GET       5.055       91.250
GET       5.055       91.875
GET       5.087       92.500
GET       5.087       93.125
GET       5.119       93.750
GET       5.119       94.062
GET       5.119       94.375
GET       5.151       94.688
GET       5.151       95.000
GET       5.183       95.312
GET       5.183       95.625
GET       5.215       95.938
GET       5.215       96.250
GET       5.247       96.562
GET       5.279       96.875
GET       5.279       97.031
GET       5.311       97.188
GET       5.311       97.344
GET       5.343       97.500
GET       5.375       97.656
GET       5.407       97.812
GET       5.439       97.969
GET       5.471       98.125
GET       5.503       98.281
GET       5.567       98.438
GET       5.599       98.516
GET       5.631       98.594
GET       5.663       98.672
GET       5.695       98.750
GET       5.727       98.828
GET       5.791       98.906
GET       5.855       98.984
GET       5.919       99.062
GET       6.015       99.141
GET       6.111       99.219
GET       6.143       99.258
GET       6.207       99.297
GET       6.271       99.336
GET       6.367       99.375
GET       6.463       99.414
GET       6.559       99.453
GET       6.655       99.492
GET       6.751       99.531
GET       6.847       99.570
GET       6.943       99.609
GET       7.007       99.629
GET       7.071       99.648
GET       7.135       99.668
GET       7.199       99.688
GET       7.231       99.707
GET       7.327       99.727
GET       7.391       99.746
GET       7.455       99.766
GET       7.519       99.785
GET       7.615       99.805
GET       7.647       99.814
GET       7.711       99.824
GET       7.775       99.834
GET       7.839       99.844
GET       7.903       99.854
GET       7.999       99.863
GET       8.063       99.873
GET       8.159       99.883
GET       8.319       99.893
GET       8.447       99.902
GET       8.575       99.907
GET       8.639       99.912
GET       8.767       99.917
GET       8.895       99.922
GET       9.087       99.927
GET       9.279       99.932
GET       9.535       99.937
GET       9.727       99.941
GET       9.983       99.946
GET      10.175       99.951
GET      10.239       99.954
GET      10.367       99.956
GET      10.559       99.958
GET      10.623       99.961
GET      10.751       99.963
GET      10.879       99.966
GET      11.071       99.968
GET      11.199       99.971
GET      11.263       99.973
GET      11.391       99.976
GET      11.519       99.977
GET      11.583       99.978
GET      11.647       99.979
GET      11.711       99.980
GET      11.775       99.982
GET      11.839       99.983
GET      11.903       99.984
GET      12.031       99.985
GET      12.095       99.987
GET      12.159       99.988
GET      12.223       99.988
GET      12.287       99.989
GET      12.287       99.990
GET      12.351       99.990
GET      12.415       99.991
GET      12.479       99.991
GET      12.543       99.992
GET      12.671       99.993
GET      12.735       99.993
GET      12.863       99.994
GET      12.927       99.994
GET      12.991       99.995
GET      13.055       99.995
GET      13.119       99.995
GET      13.247       99.995
GET      13.375       99.996
GET      13.503       99.996
GET      13.567       99.996
GET      13.631       99.997
GET      13.695       99.997
GET      13.695       99.997
GET      13.759       99.997
GET      13.887       99.997
GET      13.951       99.998
GET      14.015       99.998
GET      14.015       99.998
GET      14.079       99.998
GET      14.207       99.998
GET      14.271       99.998
GET      14.335       99.998
GET      14.335       99.999
GET      14.399       99.999
GET      14.399       99.999
GET      14.463       99.999
GET      14.463       99.999
GET      14.527       99.999
GET      14.591       99.999
GET      14.591       99.999
GET      14.655       99.999
GET      14.719       99.999
GET      14.719       99.999
GET      14.847       99.999
GET      14.847       99.999
GET      14.911       99.999
GET      14.911       99.999
GET      14.975       99.999
GET      14.975      100.000
GET      15.039      100.000
GET      15.167      100.000
GET      15.295      100.000
GET      15.359      100.000
GET      15.551      100.000
GET      15.615      100.000
GET      15.615      100.000
GET      15.679      100.000
GET      15.679      100.000
GET      15.807      100.000
GET      15.807      100.000
GET      15.999      100.000
GET      16.063      100.000
GET      16.127      100.000
GET      16.191      100.000
GET      16.191      100.000
GET      16.383      100.000
GET      16.383      100.000
GET      16.511      100.000
GET      16.511      100.000
GET      16.511      100.000
[...]
GET      16.639      100.000
GET      16.639      100.000
GET      16.639      100.000
[...]
GET      16.767      100.000
GET      16.767      100.000
---
WAIT      0.000      100.000